{
    "paper_id": "129a60938fc1938cbe00850b0ab4afddc86dc885",
    "metadata": {
        "title": "Managing crowds with technology: cases of Hajj and Kumbh Mela",
        "authors": [
            {
                "first": "Mohammad",
                "middle": [],
                "last": "Yamin",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "During the first 15 years of this century, seven thousand people have been crushed to death in stampedes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "During 2001-2016, more than seven thousands people have lost their lives to stampedes [1] . Given the state of art of modern technology and management, it is depressing to note these causalities are more than those in the entire twentieth century. Hajj [2] [3] [4] [5] accounts for more than four thousand stampede related deaths in the last twenty-five years [6] . Kumbh Mela [3] , to be referred as Kumbh, has also witnessed hundreds of stampede related death in recent times. Surely, these people did not deserve to die in that way.",
            "cite_spans": [
                {
                    "start": 86,
                    "end": 89,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 253,
                    "end": 256,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 257,
                    "end": 260,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 261,
                    "end": 264,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 265,
                    "end": 268,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 360,
                    "end": 363,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 377,
                    "end": 380,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "In this article we shall analyse different kinds of crowds and technologies which could be useful for better crowd management and prevention of disasters. We have chosen two cases, namely Hajj and Kumbh, for our study of large crowded events. In particular we shall look at the crowding nature of these events. In the process, we shall examine merits of various technologies and tools which are either being already used or could be considered for use. We shall also analyse factors for reducing risks of stampedes and other disasters in our chosen cases.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Crowds which we witness time to time differ in many ways. Some crowded events can be classified as regular while others as irregular. Regular crowded events like those of Hajj, Kumbh, Arbaeen [6] , Badrinath Yatra [7] are predictable in nature and behaviour, and crowding in them can normally be contained. Irregular events usually occur once or are spontaneous in nature like those of a funeral procession, protest or celebration March, election rally, sporting event or musical concerts. Estimation of the crowd size of an irregular event is very difficult and often impossible. Let us look at some of the irregular gatherings. The funeral of the Iranian leader Ayatollah Khomeini, in Tehran in 1989 was attended by about eleven million people [8] . About four million people gathered for the funeral of the Egyptian singer Umm Kulthum in 1975 [9] . The funeral of Princess Diana [10] in September 1997 had attracted about one million people. More than six million people participated in the Concluding Eucharistic Celebration [11] in Manila by the Pope Francis in January 2015. Three million people marched in February 2003 in the streets of Rome [12] to oppose the invasion of Iraq led by the United States of America. Stanley Cup parade attracted two million people in Philadelphia, USA in 1974 [13] .",
            "cite_spans": [
                {
                    "start": 192,
                    "end": 195,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 214,
                    "end": 217,
                    "text": "[7]",
                    "ref_id": null
                },
                {
                    "start": 746,
                    "end": 749,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 846,
                    "end": 849,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 882,
                    "end": 886,
                    "text": "[10]",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 1029,
                    "end": 1033,
                    "text": "[11]",
                    "ref_id": null
                },
                {
                    "start": 1150,
                    "end": 1154,
                    "text": "[12]",
                    "ref_id": null
                },
                {
                    "start": 1300,
                    "end": 1304,
                    "text": "[13]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Management of irregular events can be a daunting task because of the unpredictable size and nature. However, moving events like parades and processions are relatively easy to manage because of their stretch over a large area. Occurrence of stampedes is normally attributed to overcrowding and mismanagement. Our study of the past stampedes of hajj and Kumbh revealed that the hotspots were cramped places assembly and walkway intersections. A stampede may also quite likely occur due to a sudden or unplanned stoppage of a section of the moving crowd. One may think that the management of regular events is easier. But the statistics [6] point to quite an opposite conclusion as most of the deaths have occurred in the stampedes of the Hajj and Kumbh.",
            "cite_spans": [
                {
                    "start": 634,
                    "end": 637,
                    "text": "[6]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "From the historical accounts and statistics, we find that the number of participants in many of recurring and nonrecurring events is not controlled to manageable limits, and hence catastrophes occur. For an event to be managed properly, crowds must be limited to acceptable international standard, which unfortunately we do not have. Mismanagement is another major factor for reoccurrence of disasters in large gatherings, as is evident from large number of causalities which we find in the annals of history. An example of gross mismanagement was a stampede which occurred on 13 October 2013, during the Hindu festival of Navratri, on a bridge in Datia district, Madhya Pradesh, India, killing 115 people and injuring more than 110 [14] . Religious nature of some events like Kumbh, the Hajj, Badrinath yatra and similar events prevents many reforms that the management would like to do in order to minimize the chances of stampedes. Political parties refrain from bringing reforms in religiously sensitive issues, which in turn prevent to contain build-up of crowds beyond limits. Participation of unauthorized people in certain events like the Hajj is a destabilizing factor to management. Due to these and some other regional factors, the crowds can swell to limits from very management is rendered ineffective. For example, controlling the number of pilgrims to Kumbh is increasing difficult as there is no requirement of granting permissions to the participants. Also there are no, for taking part in the Kumbh, there are no restrictions on the number of pilgrims. In this situation, only the past can give some estimate of the number of future events. In political rallies, sporting events, concerts, funerals, weddings and many other similar non-recurring events, it is not possible estimate the number of participants. In some situations, these crowds can be violent creating chaos and loss of property and lives. Another example is that of the Hajj in 2012, for which only about two million permits were issued. Apparently, participation by more than one and half million illegal pilgrims was a result of local population living in the Hajj precinct. To minimise the chances of stampedes, drowning, fires, and spread of diseases and, the size of crowds must be restricted to manageable limits. This can only be done by political will and by having a binding international standard for gatherings of people. Organisation of crowded events like Kumbh, Hajj and many other religious and social gatherings around the globe would become relatively easier to manage if political consensus was evolved for by international community to implement a commonly agreed standard for holding crowded events. Fortunately, we technology has advanced tremendously and now it much easier to track crowds and identify individuals and spot hot spots. Let us look at some of the technological tools which can be very useful in managing large crowds.",
            "cite_spans": [
                {
                    "start": 733,
                    "end": 737,
                    "text": "[14]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Let us look into some aspects of the Hajj and Kumbh for the purpose of application of technologies and improvement of their management.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cases of Hajj and Kumbh"
        },
        {
            "text": "Hajj is world's largest annual gathering of its kind. It is a gathering of millions of pilgrims in the plains of Arafat involving intense and simultaneous rituals is unique and has no parallel in the world. Many of the hajj rituals are very complex and intense in nature. Data of millions of pilgrims from many countries is collected well before the event takes place and can be organised and mined at any point of time. Hajj rituals are concluded within 5 days but the hajj journey for overseas pilgrims spans over four to 6 weeks. All pilgrims gather in Mina, a tent city close to Mecca, a day before the main ritual of the Hajj. On the day of the main ritual, all pilgrims must travel; using surface transport, to Arafat valley located about 20 km from Mina. Standing and praying in the designated area of Arafat valley during the daylight is the main ritual of Hajj. Official account of the past gatherings in Arafat ranges from two to just under four million people. There have always been thousands of unauthorised pilgrims in the past events. All pilgrims must leave the valley at the sunset and travel to a mountainous place known as Muzdalifah, located between Arafat and Mina. To and fro Arafat journey of all must be completed on the same day. Next day all of these pilgrims must return to Mina and then walk to Jamarat Bridge for first stoning ritual. It was this walk in 2015 which at an intersection in Mina caused the worst stampede of all times killing more than two thousand people [6] . After the stoning, the other rituals which follow include a journey from Mina to Mecca and back, usually on the same day. There are further two stoning rituals during the next 2 days. In the past, these rituals have caused a number of stampedes killing hundreds of pilgrims [6] . More in depth analysis and description of the Hajj and its rituals can be found in [2] [3] [4] .",
            "cite_spans": [
                {
                    "start": 1499,
                    "end": 1502,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 1779,
                    "end": 1782,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 1868,
                    "end": 1871,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1872,
                    "end": 1875,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 1876,
                    "end": 1879,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "The Hajj"
        },
        {
            "text": "Intense, frequent and simultaneous movements of millions of people and performing rituals within very tight deadlines make the hajj a very complex and unique event in the world. To make it successful, the government of Saudi Arabia through the governorate of Mecca and its various ministries has provided state of art infrastructure and facilities to perform the Hajj. However, despite excellent organization, the hajj management, to a large extent, remains manual. With the ongoing technological advances and changing environment, the hajj management should make use of the latest technologies. There are several steps which need to be taken if the hajj management is to take full advantage of these technologies. In particular, the hajj management would need an efficient Enterprise Resource Planning (ERP) linking the key functions such as pilgrim checking, tracking, identification, travel, accommodation, health management, crowd movement and so on.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The Hajj"
        },
        {
            "text": "Given hectic and crowded movements of millions of pilgrims, health and hospital management for pilgrims is a very critical functional. Providing emergency and health services for these people for several weeks is an extremely difficult task. Hajj is a journey that many people like to take on again and again. Despite several check posts, thousands of unaccounted people find their way to hajj. Before the grant of hajj permission, all pilgrims are required to furnish health certificates. However, bogus health certificates from certain countries cannot be ruled out. Quite possibly, some pilgrims with inaccurate health certificates may bring and spread contagious viruses like that of HIV Aids. Monitoring and managing unregistered pilgrims and those with misleading health condition are very difficult tasks.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The Hajj"
        },
        {
            "text": "Kumbh (to be referred as Kumbh) is organised once in 3 years and its venue rotates among four different Indian cities namely, Allahabad, Haridwar, Ujjan and Nasik [7] . Kumbh attracts tens of million participants, making it as an event of largest number of people. However, many pilgrims in this (six to eight weeklong) event usually participate in for only a week or so. As all of the Kumbh venues are situated on banks of rivers, crowd can spread out, making it slightly easier to manage. However, the crowd on the day of Mauni Amavasya [15] has in the past caused stampedes. During 2013, about thirty million pilgrims had a dip at the junction of Ganga, Yamuna and Sarasvati in Allahabad.",
            "cite_spans": [
                {
                    "start": 163,
                    "end": 166,
                    "text": "[7]",
                    "ref_id": null
                },
                {
                    "start": 539,
                    "end": 543,
                    "text": "[15]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Kumbh"
        },
        {
            "text": "Modern technologies can be very helpful in crowd and disaster management. Some of the recurring events like Kumbh and the Hajj often involve rituals which take place on a particular day and time. Any ritual which calls for participation of all of its participants at a designated time and day is prone to disasters such as stampedes, fires, drowning and other catastrophes. Pilgrims as well as the event managers in such complex and intense crowds would find themselves in a position to helplessness. Intense crowding is also responsible in spreading contagious bacteria, viruses, and diseases. In such situations, tracking, accessibility and identification of pilgrims is critically important.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "An overview of tools and technologies for crowd controlling"
        },
        {
            "text": "Technological developments of 21st century have produced many tools and gadgets which can be used to improve the event and disaster management. For example, Radio Frequency Identification (RFID) as shown in Fig. 1 , also see [16] , can be used for controlling, monitoring and managing the movement of crowds, and hence to prevent the occurrence of many disasters. For example, movement of thousands of fuel laden trucks of the Saudi Arabian Company Aramco, the largest oil company of the world, is using various already in use by many businesses involving tracking and tracking devices to locate and manage the movement of their goods. Keeping track of participants in an event, tools tracking (specially the surgical tools), library books tracking, laundry management of thousands of uniforms, tracking the movements of individuals like husbands and wives, passport, credit cards, guns control, car thefts, mobile phones, preventing theft of articles from shopping malls, and many other usage in sports, fashion, robbery proof chips.",
            "cite_spans": [
                {
                    "start": 225,
                    "end": 229,
                    "text": "[16]",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [
                {
                    "start": 207,
                    "end": 213,
                    "text": "Fig. 1",
                    "ref_id": null
                }
            ],
            "section": "Using of RFID"
        },
        {
            "text": "Fog is a model for computing, introduced by CISCO in 2012 to reduce or eliminate some limitations of Cloud computing. Fog can be defined as an extension of Cloud to the edge of a network with smaller memory and processing power-it can be any device with an ability to do some computing and storage. Therefore, unlike Clouds, Fog is close to the end user and supports distributed computing model instead of only the central one. More information about Fog can be found from [17] . Here we provide properties of the Fog which differ from Cloud.",
            "cite_spans": [
                {
                    "start": 473,
                    "end": 477,
                    "text": "[17]",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "Using fog and cloud computing"
        },
        {
            "text": "1. Fog can be any device has ability to compute and cache data in addition to network. However, Cloud is a set of servers. 2. Support the applications that are sensitive time response and latency as healthy apps, where using Fog makes the latency very low in addition to increasing the response speed and decrease the traffic on the links, while in the Cloud there is big latency. 3. Since the Fog node is near to end user which makes it suitable for performing filtering and processing on data before sending it to the Cloud, that means the overhead on the Cloud will be decreased, and the traffic on the link and network also. So that, it is very useful for big data applications. Ex. Fog can process images and detect features then send these features instead of images to the Cloud. While the Cloud is good for analysing historical or big data.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Using fog and cloud computing"
        },
        {
            "text": "4. Fog can do some policy on data also before sending it to Cloud and that increases the security, especially for IoT objects not having enough memory and processing power to perform same these tasks. 5. Fog support the mobility apps as smart traffic and manage crowd more than Cloud. 6. Fog increases the availability service comparing to cloud and that very benefit for crowds. 7. Fog nodes can be spread intensity to cover any area fully as Hajj place, so it supports the distributed computing not only central as Cloud. 8. There is limitation in resources of Fog node which these resources unlimited in the Cloud, so Fog computing cannot be instead of Cloud but it can integrate with it. 9. Fog supports awareness location and that not achieved in the Cloud. 10 Undoubtedly, lack in preventive measures and poor management of these deadly viruses can be devastating. These viruses can easily spread in dense and poorly managed crowds. Every year we have many crowded events take place, most of which happen to be in developing and economically poor counties. For details, see [19] [20] [21] [22] [23] [24] . We certainly need the technologies and expertise to safeguard the participants against all kinds of threats and disasters. An aim of this article is to propose a framework improve the hajj management for wellbeing of the pilgrims. Our framework advocates the use of latest technologies such as RFID, Mobile Apps, IoT, and Digital Streets. The framework resulting from this project can also be utilized during the Omrah season, especially during the month Ramadan, when the crowding also becomes very intense.",
            "cite_spans": [
                {
                    "start": 763,
                    "end": 765,
                    "text": "10",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 1080,
                    "end": 1084,
                    "text": "[19]",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 1085,
                    "end": 1089,
                    "text": "[20]",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 1090,
                    "end": 1094,
                    "text": "[21]",
                    "ref_id": "BIBREF16"
                },
                {
                    "start": 1095,
                    "end": 1099,
                    "text": "[22]",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 1100,
                    "end": 1104,
                    "text": "[23]",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 1105,
                    "end": 1109,
                    "text": "[24]",
                    "ref_id": "BIBREF19"
                }
            ],
            "ref_spans": [],
            "section": "Using fog and cloud computing"
        },
        {
            "text": "Unlike Hajj, which is an annual event with a fixed venue, Kumbh is organised once in 3 years and its venue rotates amongst four different cities. Kumbh pilgrimage doesn't require prior permission; therefore the data of the pilgrims is not collected. From management point of view, it is increasing difficult to keep track of the people entering the venue of the event from all sides and by all possible means of transport, millions of them making it to on foot. Nevertheless, mobile and wireless technologies can still play a significant part in improving the management of Kumbh.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Case for using technology in Kumbh management"
        },
        {
            "text": "Arba'een is one the largest peaceful gatherings in history, in which in 2013, about twenty million pilgrims from forty countries travelled the fifty-five miles journey on foot from Basra to the city of Karbala in Iraq [6] . The journey involves about 2 weeks of walking culminating in a gathering in Karbala to commemorate 40 days mourning of the death of Imaam Husain, a grandson of prophet Muhammed. This event has been subject to stampedes and terror attacks. A car bomb targeting worshippers returning from Karbala killed at least 20 pilgrims in January 2013. Badrinath Yatra [7] is a journey to a shrine in Badrinath located in the sub Himalayan region of Uttrakhand, India, at a height of more than three thousand meters. Up to a million people, mostly Indians, undertake this journey. This activity needs to be managed as it involves occasional attacks from some groups. Organisation and management of both of these and other similar events can also benefit from the wireless and mobile technologies.",
            "cite_spans": [
                {
                    "start": 218,
                    "end": 221,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 580,
                    "end": 583,
                    "text": "[7]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Other cases regular crowd cases for using technology"
        },
        {
            "text": "There are many significant and important large gatherings, most of which occur as and when are required. Like the regular gathering, they too have complex management issues of overcrowding, stampedes, fires, terror attacks and spread of disasters. In most of these gatherings, number of participants and their behaviours can be unpredictable. These gatherings can be religious, social, political, mourning processions and deliberations. Often poor anticipation and organisation of these kinds of events often leads to stampedes and other disasters. Indeed modern technologies can help better organisation of these kinds of crowds.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Case for using technology in irregular events"
        },
        {
            "text": "Recently, we have witnessed an unprecedented spread of EBOLA in most of the West African countries. Also, recent spread of MERS in South Korea was something that has surprised many. Indeed these viruses and bacteria are contagious and can spread very quickly if not checked. Spread of these diseases have affected many educated people and consequently they have refrained from participating in crowded events or have taken due precautions. But the number of participants in regular events like the Hajj and Kumbh hasn't come down. On the contrary, the number has gone up. It is well known that the participants in crowded events of three or more days duration causes the spread of common flu and other diseases due to unhygienic conditions. Another serious health risk arises from the inability of preventing infected illegal pilgrims from entering events. Due to intense crowding and lack of infrastructure, many a times, it is not feasible to check and process all pilgrims within realistic timeframe. In some crowded events such as the Hajj, there is a mandatory requirement of to be medically fit and hence all pilgrims are required to undergo certain vaccinations and produce certificate of fitness. As for the pilgrims to the Kumbh, there is a requirement of vaccinations but many pilgrims can sneak into the Kumbh without having to undergo medical examination. In most of the non-recurring events, vaccination and medical examination of all the participants is in current situations is impossible. The biometric scans at all the major air and sea ports of Saudi Arabia are capable of identifying people with forged documents. The problem however still remains to check the local pilgrims from Makkah region and prevent unauthorised ones from performing the Hajj. But in case of Kumbh, it is difficult to ensure filter the pilgrims with dangerous viruses into the event as there is no system in place of providing permitted on the basis of full health check-up. Equally difficult is to ensure that the health examinations carried out by health centres are not compromised. Thus there are real possibilities of some pilgrims carrying contagious viruses and diseases into the Hajj and Kumbh. More study of health related issues can be found in [25, 26] .",
            "cite_spans": [
                {
                    "start": 2248,
                    "end": 2252,
                    "text": "[25,",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 2253,
                    "end": 2256,
                    "text": "26]",
                    "ref_id": "BIBREF21"
                }
            ],
            "ref_spans": [],
            "section": "Case for using technology to minimise health risks"
        },
        {
            "text": "People on their death bed often want to perform religious acts. Very often they want to perform a pilgrimage. Thus, it is almost impossible to prevent such people from doing pilgrimage. In regular events like the Hajj, where prior permissions are granted on the basis of medical and security check-ups, administration may succeed to deny the entry to the infected people. But in non-regular events like rallies and processions, it is not feasible to scrutinise participants. Thus, the event managers must have a framework to deal with sick and infected people to safeguard the health of the participants. On the other hand, in some instances, medical reports can be compromised and infected people may succeed to secure a false certificate of health. These are calls for the organisers of recurring events like Kumbh and the Hajj should seriously revise their policies on sick people and progressively consider allowing them to perform the pilgrimage. For it to be accomplished, the organisers must make special arrangements to segregate the sick, infected and terminally ill people for performing their pilgrimages. In doing so, the sick and infected people will come forward to avail the special facilities instead of hiding in the crowds, as the case presently. One of the key elements for a successful organisations and management of crowded events is to know the kind of participants, and accordingly have definite plans for their management. Having basic knowledge about the health of all pilgrims is essential for a successful management of crowded events. Spread of a communicable disease in a crowded event may have devastating results. However, all of these considerations and concessions shouldn't apply in cases of diseases like EBOLA which are difficult to contain, until a satisfactory way of preventing their spread is discovered. However, people infected with HIV and Hepatitis viruses are capable of being managed and hence could be allowed under supervision. The management shouldn't neglect disabled and elderly pilgrims and should make adequate arrangements for their wellbeing during their participation in the event.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Case for using technology to manage infected pilgrims"
        },
        {
            "text": "Limiting the number of participants in large events, especially the irregular ones, has so far been unsuccessful. If the future events are also going to attract crowds beyond manageable limits, we should expect more disasters. Technology can improve management but is not a cure for overcrowding. So, for a successful management of events, the number of participants must be limited in accordance with a commonly agreed standard for gatherings. We need a standard for crowding, which does not yet exit but is very desirable. Having a crowding standard, organises would be empowered to prevent out of bound crowds and hence prevent many disasters which would otherwise occur. The managers of events need a framework to manage the crowds. A management framework to deal with recurring events like the Kmubh and the Hajj is shown in Fig. 4 . For a framework for managing crowds, we need to have basic data about the participants in the event, and have a set of routines to follow. As we know, currently, it is probable that some participants of events might carry HIV, SARS, MARS and other bacteria or virus with them, without the knowledge of the managers. Such participants would be living and moving with other participants. These people would be source of spreading infections and viruses to other pilgrims. To detect and manage such pilgrims, event organisers should use workflow architecture like the pilgrim workflow architecture as shown in Fig. 4 , see [34] . Event organisers must also have adequate and easy access to health facilities on the sites of the event. If any of these people become ill, they should be isolated and treated promptly. If such patients were not identified in time and not treated accordingly, the bacteria might spread into a large number of participants. The Hajj is a highly organised event but still needs to refine and articulate its operations. ",
            "cite_spans": [
                {
                    "start": 1459,
                    "end": 1463,
                    "text": "[34]",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 830,
                    "end": 836,
                    "text": "Fig. 4",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1446,
                    "end": 1452,
                    "text": "Fig. 4",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": "A framework for managing crowded events"
        },
        {
            "text": "In order to make any safety plan successful, cooperation and education amongst all stakeholders is highly desirable.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The system"
        },
        {
            "text": "In particular, users must obey the signals and commands otherwise the system would not may not attain desired goals. Another factor critical to a stampede or another disaster aversion from their occurrence is the response time. Here we propose a plan for controlling and managing crowds, our plan is divided into five phases.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The system"
        },
        {
            "text": "We divide areas and places of crowd build-ups into a number of cells and distribute crowd data from the sensor networks continuously to many computing nodes (Fog Nodes), enabling each Fog Node for speed processing and decision taking. Each set of Fog Nodes is connected to core of the Fogs to control the integration and cooperation between the nodes and to ensure data processing before relaying it to Cloud, where an extensive data analysis for detection of new knowledge is performed. The new knowledge will be very beneficial for prediction of future disasters and preparing advance solutions to deal with the aftermath of a disaster if it occurs. For details, refer to Fig. 4 .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 674,
                    "end": 680,
                    "text": "Fig. 4",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": "Hieratical of processing and control"
        },
        {
            "text": "Attach RFID-passive (low-cost) tags (cards/bracelets) to the bodies of the individuals (users) of the crowd for accessing whereabouts of them and the size of crowd in each cells as and when required. RFID tags are capable to provide information about the identity and location of each user in the selected cell. Tag Reader can be in the Fog node, or many of Readers can be distributed in the cell and the Host will be in the Fog. The Identity can be used to get more details and information about each user from the Cloud based central database. In situations where GPS and Cellular network do not work, airships may be used. Deploy different purpose WSNs in each cell for sensing parameters, conditions and situation namely, Ex. Pollution Sensors, Temperature Sensors, and Pressure Sensors, which provide important information about environment of cell and play a vital role in alerting a potential danger of a disaster. Moreover, the data sensed by these them can be stored and analysed for future purposes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Collecting/sensing data"
        },
        {
            "text": "• Use mobile applications (Android & IOS), which should be installed on users smart phones to enable them to notify the management by a simple click about any eminent danger on the location and time of their being there. In this manner, each use will act as a sensor. • Collect information from the social media like Twitter, which is considered as one of the fast ports for news nowadays. However, the management would need to perform processing on data by using a Big-data system or environment to expedite the speed of information and notification as far possible as. • Use IP-cameras, which can take high-resolution images of the crowd in each cell and then the Fog process these images to detect the likelihood of any accident or some other disaster without latency or delay.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Collecting/sensing data"
        },
        {
            "text": "Our lives are precious. We do not want catastrophes and disasters. We do not want spread of life threatening bacteria, viruses and diseases. To a large extent, fortunately, most of the gatherings have so far not been the cause of dangerous diseases. But we have witnessed many stampedes, drowning, fires and other disasters killing thousands of people in many countries associated with bad management of crowded events. We need to seriously think as to what should be done to contain the occurrence of such events. In this paper we have outlined a number of measures. One of them is to have a binding international standard for crowding. The other measures which we have suggested are to have a framework for managing crowds.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        },
        {
            "text": "We have strongly advocated the use of all available technology in our system to manage crowds. Lets us hope that the organisers of crowdd events would start making use of the available technology and improve the management of these events. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Master's Thesis submitted to Karolin-skaInstitutet",
            "authors": [],
            "year": 2016,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Managing crowds with wireless and mobile technologies",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Yamin",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "A"
                    ],
                    "last": "Basahel",
                    "suffix": ""
                },
                {
                    "first": "Abi",
                    "middle": [],
                    "last": "Sen",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "A"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Wirel Commun Mob Comput",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1155/2018/7361597"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Health management in crowded events: Hajj and Kumbh. BIJIT-BVICAM's",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Yamin",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Int J Inf Technol",
            "volume": "7",
            "issn": "1",
            "pages": "791--794",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Secure and healthy Hajj management: a technological overview",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Yamin",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Am Acad Scholarly Res J",
            "volume": "7",
            "issn": "3",
            "pages": "195--202",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "List of human stampedes",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Wikipedia",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Accessed",
            "volume": "13",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "List of largest peaceful gatherings in history",
            "authors": [],
            "year": 2018,
            "venue": "",
            "volume": "8",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Umm Kulthum: queen of The Nile. The Quietus",
            "authors": [],
            "year": 2018,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Princess of Wales",
            "authors": [
                {
                    "first": "Diana",
                    "middle": [],
                    "last": "Funeral Of",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "",
            "volume": "8",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Radio frequency identification",
            "authors": [
                {
                    "first": "V",
                    "middle": [],
                    "last": "Rajaraman",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Resonance (Indian Academy of Sciences)",
            "volume": "22",
            "issn": "6",
            "pages": "549--575",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Preserving privacy in internet of things-a survey",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "A"
                    ],
                    "last": "Abisen",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "A"
                    ],
                    "last": "Eassa",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Jambi",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Yamin",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Int J Inf Technol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1007/s41870-018-0113-4"
                ]
            }
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Real-time communication in wireless sensor networks",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Lee",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Shah",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Pau",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Prieto",
                    "suffix": ""
                },
                {
                    "first": "K-I",
                    "middle": [],
                    "last": "Kim",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Wirel Commun Mob Comput",
            "volume": "9612631",
            "issn": "2",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Ebola Virus Disease, Word Health Organisation (WHO)",
            "authors": [],
            "year": 2014,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "About Ebola virus disease, centers for disease control and prevention",
            "authors": [],
            "year": 2014,
            "venue": "",
            "volume": "7",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Tracing Ebola's Breakout to an African 2-Year-Old",
            "authors": [],
            "year": 2014,
            "venue": "",
            "volume": "7",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Severe acute respiratory syndrome",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Wikipedia",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "",
            "volume": "7",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Middle East respiratory syndrome corona-virus",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Wikipedia",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "WHO, Global Alert and Response (GAR) (Coronavirus infections",
            "authors": [],
            "year": 2014,
            "venue": "",
            "volume": "7",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Investigation of aggregation in fuzzy signatures",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "S"
                    ],
                    "last": "Mendis",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "T"
                    ],
                    "last": "Gedeon",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Koczy",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "3rd international conference on computational intelligence, robotics and autonomous systems",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Generalised weighted relevance aggregation operators for hierarchical fuzzy signatures",
            "authors": [
                {
                    "first": "Bsu",
                    "middle": [],
                    "last": "Mendis",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "D"
                    ],
                    "last": "Gedeon",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Botzheim",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "T"
                    ],
                    "last": "Kóczy",
                    "suffix": ""
                }
            ],
            "year": 2006,
            "venue": "Computational intelligence for modelling, control and automation, 2006 and international conference on intelligent agents, web technologies and internet commerce, international conference on IEEE",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1109/CIMCA.2006.110"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Layers",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Architecture of crowd control and management system",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": ". User can have full control on Fog, while there are three main levels in Cloud (SaaS, Paas, and IaaS).",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "The Kumbh is not a highly organised event because of the huge number of participants with open borders to the rest of country. Also in the Kumbh, an overwhelming number of participants come from within India. There are no visa requirements which would otherwise provide an automatic capture and storing data like in the case of the Hajj. It is recommended that the organisers of the Kumbh introduce a permit system based on health and security. Here are some guidelines which the event mangers would find beneficial, if followed.(a) Collect basic data about the participants, prior to the event if possible. (b) Introduce the system of Identity Card and an entry permit to the event. (c) Advertise well in advance that sick people are welcome to participate. (d) Make health check-up mandatory by nominated health centres a pre-condition. (e) Manage and control health check-up centres at the entry points. (f) Introduce RFID enabled wrist or waist bands, as shown in Fig. 1, to be worn by all participants. Capture all personal and health data into the pilgrim tag. (g) Use all available technological resources including biometric technology, display screens, pressure pads, mobile communication tools. (h) Make adequate arrangements for isolation of pilgrims found to be carrying communicable diseases. (i) Introduce mandatory health awareness training in some countries of the subcontinent and African countries with the help of local authorities to be sponsored by tour operators of the event. (j) Punish tour operators for noncompliance of health procedures.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}