{
    "paper_id": "135c2bacad3145424e8db55c9de4218015b366c3",
    "metadata": {
        "title": "Ribavirin, viramidine and adenosine-deaminase-catalysed drug activation: implication for nucleoside prodrug design",
        "authors": [
            {
                "first": "Jim",
                "middle": [
                    "Zhen"
                ],
                "last": "Wu",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Ribapharm Inc",
                    "location": {
                        "addrLine": "3300 Hyland Avenue",
                        "postCode": "92626",
                        "settlement": "Costa Mesa",
                        "region": "CA",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Chin-Chung",
                "middle": [],
                "last": "Lin",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Ribapharm Inc",
                    "location": {
                        "addrLine": "3300 Hyland Avenue",
                        "postCode": "92626",
                        "settlement": "Costa Mesa",
                        "region": "CA",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Zhi",
                "middle": [],
                "last": "Hong",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Ribapharm Inc",
                    "location": {
                        "addrLine": "3300 Hyland Avenue",
                        "postCode": "92626",
                        "settlement": "Costa Mesa",
                        "region": "CA",
                        "country": "USA"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "The epidemics caused by pathogenic viruses, such as HIV, hepatitis C virus (HCV) and most recently the severe acute respiratory syndrome (SARS) by a new coronavirus, represent major global health hazards, which demand novel broad-spectrum antiviral intervention. Although discovered 40 years ago, ribavirin (1-β-D-ribofuranosyl-1,2,4-triazole-3-carboxamide) remains the only approved small molecule drug that is active against both DNA and RNA viruses. 1 The unique antiviral profile of ribavirin deserves a brief review of its discovery. Back in the 1960s, two five-membered ring nucleoside antibiotics, showdomycin and pyrazomycin, were isolated from bacterial culture, and both ( Figure 1 ) showed significant activity against a broad series of viruses in cell culture. The novel properties of these nucleoside antibiotics prompted synthesis and testing of a number of imidazole-and triazole-based ribonucleosides. 2 Among them, ribavirin (originally termed Virazole) stood out as the most promising broad-spectrum antiviral agent. Structurally, ribavirin is a ribonucleoside with an unconventional triazole base ( Figure 1 ). X-ray crystallographic studies indicated that the five-membered triazole ribonucleoside is capable of mimicking the conformation of several canonical purine ribonucleosides with its 3-carboxamide oxygen and nitrogen spatially eclipsing the O6 and N1 atoms of inosine and guanosine. By rotating the C3-C6 bond by 180°, ribavirin also resembles the conformation of adenosine. The multiple conformations adopted by ribavirin make it possible to target both viral and host enzymes that utilize purine ribonucleosides/nucleotides as a substrate or a cofactor, and may hold the key for its broad-spectrum antiviral activity. Current data support the notion that ribavirin acts by pleiotropic modes of action. 3 Ribavirin itself is a prodrug that is metabolized to the active 5′-monophosphate, -diphosphate and -triphosphate in vivo. Ribavirin 5′-monophosphate (RMP) inhibits cellular inosine monophosphate dehydrogenase (IMPDH), thereby depleting intracellular pools of GTP for viral replication. Ribavirin 5′-triphosphate (RTP) is the major metabolite accumulated in vivo. It is an effective inhibitor of viral RNA guanylyl transferase and (guanine-7 N-)-methyl transferase, contributing to the defective 5′-cap structure of viral transcripts and insufficient translation. All the 5′-phosphate forms of ribavirin have been implicated as direct inhibitors of viral RNA polymerases. As a nucleotide analogue, RTP can also be incorporated into a viral genome and induces virus error catastrophe by mutations. 4 In a recent study of poliovirus replication in cell culture, a single mutation in the poliovirus RNA-dependent RNA polymerase was shown to confer resistance to ribavirin. 5 This is the first report of viral resistance to ribavirin. This study reinforces the notion that the transition mutations caused by incorporation of ribavirin as a mutagen are responsible for antiviral activity, at least in the case of poliovirus. On the other hand, consistent with the broad-spectrum antiviral property, ribavirin is also a small molecule immunomodulator and is capable of eliciting immuno-based antiviral activities by shifting the host immune response to 'type 1', thereby enhancing T cell mediated immunity that favours elimination of intracellular viral pathogens. The fact that no ribavirin resistance has been convincingly identified in the clinical setting supports the notion that ribavirin exerts its effect through non-specific or pleiotropic mechanisms.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 683,
                    "end": 691,
                    "text": "Figure 1",
                    "ref_id": null
                },
                {
                    "start": 1118,
                    "end": 1126,
                    "text": "Figure 1",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        },
        {
            "text": "Despite its success as an effective antiviral in cell culture and in animal infection models, the clinical application of ribavirin has so far met with mixed results. One factor that may limit its clinical potential is the dose-limiting haemolytic anaemia when high doses are administered. Ribavirin formulated as small particle aerosol is currently approved for treatment of the respiratory syncytial virus (RSV) infection. In capsule or tablet form it is used as a part of combination therapy for chronic HCV infection. Notably, the combination therapy of ribavirin with interferon-α (both native and pegylated forms) has become the 'gold' standard for anti-HCV chemotherapy.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "For the treatment of HCV infection, combination therapy suffers somewhat from the side effect of haemolytic anaemia caused by the accumulation of RTP in red blood cells (RBCs). This results in dose reduction or discontinuation of therapy in a proportion of patients. In an attempt to deliver ribavirin more specifically to the liver and reduce the trapping of ribavirin metabolites in RBCs, thereby improving the therapeutic index, a number of ribavirin derivatives have been explored. One emerging compound is the 3-carboxamidine derivative of ribavirin, viramidine (previously known as ribamidine) 6 (see Figure 3 ). As one of the compounds related to ribavirin by structure-activity relationship studies, it exhibits in vitro antiviral and immunomodulation activities comparable to ribavirin. 7 Recent biochemical and pharmacokinetic studies have shown that viramidine acts as a prodrug of ribavirin and has very different pharmacokinetic properties from its parent compound. 8, 9 Possibly as a result of .",
            "cite_spans": [
                {
                    "start": 979,
                    "end": 981,
                    "text": "8,",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 982,
                    "end": 983,
                    "text": "9",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [
                {
                    "start": 607,
                    "end": 615,
                    "text": "Figure 3",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The epidemics caused by pathogenic viruses, such as HIV, hepatitis C virus (HCV) and most recently the severe acute respiratory syndrome (SARS) by a new coronavirus, represent major global health hazards, which demand novel broad-spectrum antiviral intervention. Although discovered 40 years ago, ribavirin (1-β-D-ribofuranosyl-1,2,4-triazole-3-carboxamide) remains the only approved small molecule drug that is active against both DNA and RNA viruses. 1 The unique antiviral profile of ribavirin deserves a brief review of its discovery. Back in the 1960s, two five-membered ring nucleoside antibiotics, showdomycin and pyrazomycin, were isolated from bacterial culture, and both ( Figure 1 ) showed significant activity against a broad series of viruses in cell culture. The novel properties of these nucleoside antibiotics prompted synthesis and testing of a number of imidazole-and triazole-based ribonucleosides. 2 Among them, ribavirin (originally termed Virazole) stood out as the most promising broad-spectrum antiviral agent. Structurally, ribavirin is a ribonucleoside with an unconventional triazole base ( Figure 1 ). X-ray crystallographic studies indicated that the five-membered triazole ribonucleoside is capable of mimicking the conformation of several canonical purine ribonucleosides with its 3-carboxamide oxygen and nitrogen spatially eclipsing the O6 and N1 atoms of inosine and guanosine. By rotating the C3-C6 bond by 180°, ribavirin also resembles the conformation of adenosine. The multiple conformations adopted by ribavirin make it possible to target both viral and host enzymes that utilize purine ribonucleosides/nucleotides as a substrate or a cofactor, and may hold the key for its broad-spectrum antiviral activity. Current data support the notion that ribavirin acts by pleiotropic modes of action. 3 Ribavirin itself is a prodrug that is metabolized to the active 5′-monophosphate, -diphosphate and -triphosphate in vivo. Ribavirin 5′-monophosphate (RMP) inhibits cellular inosine monophosphate dehydrogenase (IMPDH), thereby depleting intracellular pools of GTP for viral replication. Ribavirin 5′-triphosphate (RTP) is the major metabolite accumulated in vivo. It is an effective inhibitor of viral RNA guanylyl transferase and (guanine-7 N-)-methyl transferase, contributing to the defective 5′-cap structure of viral transcripts and insufficient translation. All the 5′-phosphate forms of ribavirin have been implicated as direct inhibitors of viral RNA polymerases. As a nucleotide analogue, RTP can also be incorporated into a viral genome and induces virus error catastrophe by mutations. 4 In a recent study of poliovirus replication in cell culture, a single mutation in the poliovirus RNA-dependent RNA polymerase was shown to confer resistance to ribavirin. 5 This is the first report of viral resistance to ribavirin. This study reinforces the notion that the transition mutations caused by incorporation of ribavirin as a mutagen are responsible for antiviral activity, at least in the case of poliovirus. On the other hand, consistent with the broad-spectrum antiviral property, ribavirin is also a small molecule immunomodulator and is capable of eliciting immuno-based antiviral activities by shifting the host immune response to 'type 1', thereby enhancing T cell mediated immunity that favours elimination of intracellular viral pathogens. The fact that no ribavirin resistance has been convincingly identified in the clinical setting supports the notion that ribavirin exerts its effect through non-specific or pleiotropic mechanisms.",
            "cite_spans": [
                {
                    "start": 453,
                    "end": 454,
                    "text": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 918,
                    "end": 919,
                    "text": "2",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1833,
                    "end": 1834,
                    "text": "3",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 2631,
                    "end": 2632,
                    "text": "4",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 2804,
                    "end": 2805,
                    "text": "5",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [
                {
                    "start": 683,
                    "end": 691,
                    "text": "Figure 1",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1118,
                    "end": 1126,
                    "text": "Figure 1",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": ""
        },
        {
            "text": "Despite its success as an effective antiviral in cell culture and in animal infection models, the clinical application of ribavirin has so far met with mixed results. One factor that may limit its clinical potential is the dose-limiting haemolytic anaemia when high doses are administered. Ribavirin formulated as small particle aerosol is currently approved for treatment of the respiratory syncytial virus (RSV) infection. In capsule or tablet form it is used as a part of combination therapy for chronic HCV infection. Notably, the combination therapy of ribavirin with interferon-α (both native and pegylated forms) has become the 'gold' standard for anti-HCV chemotherapy.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "For the treatment of HCV infection, combination therapy suffers somewhat from the side effect of haemolytic anaemia caused by the accumulation of RTP in red blood cells (RBCs). This results in dose reduction or discontinuation of therapy in a proportion of patients.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "In an attempt to deliver ribavirin more specifically to the liver and reduce the trapping of ribavirin metabolites in RBCs, thereby improving the therapeutic index, a number of ribavirin derivatives have been explored. One emerging compound is the 3-carboxamidine derivative of ribavirin, viramidine (previously known as ribamidine) 6 (see Figure 3 ). As one of the compounds related to ribavirin by structure-activity relationship studies, it exhibits in vitro antiviral and immunomodulation activities comparable to ribavirin. 7 Recent biochemical and pharmacokinetic studies have shown that viramidine acts as a prodrug of ribavirin and has very different pharmacokinetic properties from its parent compound. 8, 9 Possibly as a result of Animal studies indicate that viramidine has a better liver targeting property than ribavirin and the liver is thought to be the main conversion site of the prodrug. As illustrated by the quantitative whole body autoradiography of rats ( Figure 2 ), there is more radiolabelled drug trapped in the liver after the oral dosing of [ 14 C]viramidine compared with that of [ 14 C]ribavirin. 9 Further studies in monkeys suggest that viramidine yields three times more drug in the liver but only half of the drug level in RBCs compared with ribavirin. 9 Because of this preferential liver targeting property and the concomitant reduction in the haemolytic potential, viramidine appears to be a safe alternative to ribavirin, and it may provide many clinical benefits to HCV patients. It is currently in a Phase II clinical trial for the active chronic HCV infection.",
            "cite_spans": [
                {
                    "start": 529,
                    "end": 530,
                    "text": "7",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 712,
                    "end": 714,
                    "text": "8,",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 715,
                    "end": 716,
                    "text": "9",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 1127,
                    "end": 1128,
                    "text": "9",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 1287,
                    "end": 1288,
                    "text": "9",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [
                {
                    "start": 340,
                    "end": 348,
                    "text": "Figure 3",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 978,
                    "end": 986,
                    "text": "Figure 2",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": ""
        },
        {
            "text": "To understand the metabolic conversion of viramidine into ribavirin and gain knowledge of prodrug design, we have investigated the enzymic mechanism of viramidine deamination. Based on the structural similarity of viramidine to adenosine, adenosine deaminase (ADA) was believed to be the potential enzyme that catalyses the conversion. ADA catalyses the hydrolytic deamination of adenosine to inosine and ammonia and is a key enzyme in purine metabolism. It is ubiquitously present in virtually all mammalian tissues and is critical for immune competence. 10 Using a UV spectroscopic method, we discovered that ADA indeed catalyses the conversion of viramidine into ribavirin in vitro. 8 The enzymic reaction has a catalytic efficiency of 0.19 mM -1 s -1 in a PBS buffer of pH 7.3. Interestingly, by shifting the buffer's pH from 7.3 to 9.5, the catalytic efficiency is increased by 320-fold to 61 mM -1 s -1 with a K m of 0.46 mM and a k cat of 28 s -1 . Compared with the deamination of adenosine, this reaction has an unusually high optimal pH of 10. This optimal pH coincides with the pK a of the 3-carboxamidine of viramidine, implying that viramidine first undergoes deprotonation before deamination. Previous studies reported that ribavirin is deaminated in vivo to a carboxylic derivative, ICN3297, a metabolite that does not possess any antiviral activity (Figure 3a) . Therefore, we further investigated the possibility that ADA catalyses another round of deamination, converting ribavirin into ICN3297. 8 This deamination is very slow with a catalytic efficiency of 0.037 mM -1 s -1 at the optimal pH of 7.3. Although this study cannot rule out the participation of other enzymes in metabolizing viramidine, it nevertheless suggests that ADA is a strong candidate for the conversion in vivo. These experiments also reveal the unusual propensity of ADA to catalyse two consecutive deamination reactions on a single substrate by first The 50-µm thick sections were prepared using an LKB-microtome and were exposed to highly sensitive film for 8 days. Major organs/tissues were identified on each section and their respective radioactive content was measured quantitatively using computerized densitometry. In the coloured image, the redness density reflects the amount of radioactivity in the section. Clearly, the liver was enriched with much more drug in the viramidine-treated rat than the ribavirintreated rat.",
            "cite_spans": [
                {
                    "start": 556,
                    "end": 558,
                    "text": "10",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 686,
                    "end": 687,
                    "text": "8",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 1514,
                    "end": 1515,
                    "text": "8",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [
                {
                    "start": 1365,
                    "end": 1376,
                    "text": "(Figure 3a)",
                    "ref_id": "FIGREF3"
                }
            ],
            "section": ""
        },
        {
            "text": "hydrolysing viramidine, and then slowly converting ribavirin into an inactive metabolite (Figure 3a ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 89,
                    "end": 99,
                    "text": "(Figure 3a",
                    "ref_id": "FIGREF3"
                }
            ],
            "section": ""
        },
        {
            "text": "An enzyme-activated prodrug approach is a strategy widely employed to improve absorption, bioavailability and target specificity of potential therapeutic agents in order to minimize adverse side effects. ADA is an ideal enzyme for prodrug activation because of its ubiquitous presence in human tissues and its enormous catalytic capability. Indeed, many examples of ADA-activated purine nucleoside prodrugs have been reported (Figure 3b ). For example, the 6-amino prodrug of antiherpetic aciclovir has been reported for improvement of absorption through the gut to attain higher plasma levels. 11 Similarly, the 6-amino derivative of 2′-β-fluoro-2′,3′-dideoxyinosine (F-ddI) or 2′,3′-dideoxyinosine (ddI) was prepared as a more acid-stable prodrug for central nervous delivery. 12 2,6-Diaminopurine dioxolane is currently in clinical trials as a more water-soluble and bioavailable prodrug of guanine dioxolane for treatment of HIV infection. 13 6-Aminocarbovir is designed for enhanced systemic and central nervous system delivery. 14 However, all these prodrugs are based on a 6-aminopurine or 2,6-diaminopurine base and are converted into inosine or guanosine by ADA (Figure 3b) . Viramidine is the only example of an ADA-activated prodrug that possesses a non-cognate five-membered triazole base in the place of a purine.",
            "cite_spans": [
                {
                    "start": 595,
                    "end": 597,
                    "text": "11",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 779,
                    "end": 781,
                    "text": "12",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 944,
                    "end": 946,
                    "text": "13",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 1034,
                    "end": 1036,
                    "text": "14",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 426,
                    "end": 436,
                    "text": "(Figure 3b",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1171,
                    "end": 1182,
                    "text": "(Figure 3b)",
                    "ref_id": "FIGREF3"
                }
            ],
            "section": ""
        },
        {
            "text": "An enzyme-activated prodrug has to be a good substrate in order to be efficiently converted into the active form. The mechanism and substrate specificity of ADA-catalysed deamination can be comprehended at the atomic level from the co-crystal structure of ADA complexed with the transition-state analogue, 6-hydroxy-1,6dihydropurine ribonucleoside (HDPR). 15 By modelling adenosine to replace HDPR in the active site, the ground state of adenosine binding Examples of ADA-activated prodrugs, including 2,6-diaminopurine dioxolane, 6-aminoaciclovir and 6-aminocarbovir. (c) The specific interactions between adenosine and the ADA active site. Adenosine is modelled to replace HDPR at the ADA active site based on the published co-crystal structure of ADA complexed with HDPR. 15 to ADA is visualized (Figure 3c) . Evidently, ADA initiates hydrolytic deamination with Asp 295 acting as a general base to assist the zinc-bound water molecule for a nucleophilic attack at the C6 position of adenosine. Substrate recognition commands non-specific hydrophobic interaction as well as specific interactions. For adenosine, N1, N3 and N7 of the purine ring form three individual hydrogen bonds with the active-site residues, Glu 217 , Gly 184 and Asp 296 , respectively (Figure 3c ). Among them, the first interaction is believed to be critical for catalysis and the latter two are important for substrate recognition and binding affinity. 15 Conversely, the ribose forms few direct interactions with the enzyme. Both the 2′-and 3′-hydroxy groups of the ribose interact with an ordered active-site water molecule. In addition, the 3′-hydroxy forms a hydrogen bond with Asp 19 . Since dideoxy ribonucleosides can be utilized as a substrate for ADA, these three hydrogen bonds are likely to be insignificant for substrate recognition. However, the 5′-hydroxy appears to play a key role in the ribose recognition, since it interacts with both His 17 and Asp 19 through a hydrogen bond (Figure 3c ). Based on the structural analysis, ADA should tolerate major structural alteration on the ribose but less on the purine. To design a sound prodrug, the three specific hydrogen bonds for the purine and the two with the 5′-hydroxy should be preserved. This conclusion is consistent with the structural features of the known prodrugs. As illustrated in Figure 3 (b), all the known prodrugs have an intact purine and an equivalent 5′-hydroxy group. Of all the ADA-activated prodrugs, viramidine is the only one that misses the critical N3-Gly 184 hydrogen bond and this explains the very high K m value for viramidine. Nevertheless, the fact that viramidine is an ADA-activated prodrug suggests that it is possible to design a prodrug by employing a non-cognate five-membered ring base in the place of purine, providing most of the critical interactions are conserved.",
            "cite_spans": [
                {
                    "start": 356,
                    "end": 358,
                    "text": "15",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 775,
                    "end": 777,
                    "text": "15",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 1431,
                    "end": 1433,
                    "text": "15",
                    "ref_id": "BIBREF15"
                }
            ],
            "ref_spans": [
                {
                    "start": 799,
                    "end": 810,
                    "text": "(Figure 3c)",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1261,
                    "end": 1271,
                    "text": "(Figure 3c",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1973,
                    "end": 1983,
                    "text": "(Figure 3c",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 2336,
                    "end": 2344,
                    "text": "Figure 3",
                    "ref_id": "FIGREF3"
                }
            ],
            "section": ""
        },
        {
            "text": "With the availability of much biochemical and structural information on ADA, it is relatively straightforward to design an ADAactivated nucleoside prodrug. However, the first and daunting task is to discover a broad-spectrum antiviral nucleoside in the first place. Compared with the pervasive nucleotide prodrug design that is focused on the modification of 5′-phosphate for in vivo delivery, ADA-activated prodrugs possess novel pharmacokinetic properties. The verification of the ADA-catalysed viramidine conversion into ribavirin has opened a new chapter to design novel and organ-specific ADA-activated nucleoside prodrugs for antiviral and anticancer chemotherapy.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Broadspectrum antiviral activity of Virazole: 1-β-D-ribofuranosyl-1,2,4-triazole-3-carboxamide",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "W"
                    ],
                    "last": "Sidwell",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "H"
                    ],
                    "last": "Huffman",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "P"
                    ],
                    "last": "Khare",
                    "suffix": ""
                }
            ],
            "year": 1972,
            "venue": "Science",
            "volume": "177",
            "issn": "",
            "pages": "705--711",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Ribavirin: structure and antiviral activity relationships",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Harris",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "K"
                    ],
                    "last": "Robins",
                    "suffix": ""
                }
            ],
            "year": 1980,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "1--21",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Mechanisms of action of ribavirin in antiviral therapies",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "C"
                    ],
                    "last": "Tam",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "Y"
                    ],
                    "last": "Lau",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Hong",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Antiviral Chemistry and Chemotherapy",
            "volume": "12",
            "issn": "",
            "pages": "261--72",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "The broad-spectrum antiviral ribonucleoside ribavirin is an RNA virus mutagen",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Crotty",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Maag",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "J"
                    ],
                    "last": "Arnold",
                    "suffix": ""
                }
            ],
            "year": 2000,
            "venue": "Nature Medicine",
            "volume": "6",
            "issn": "",
            "pages": "1375--1384",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "A single mutation in poliovirus RNA-dependent RNA polymerase confers resistance to mutagenic nucleotide analogs via increased fidelity",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "K"
                    ],
                    "last": "Pfeiffer",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Kirkegaard",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Proceedings of the National Academy of Sciences",
            "volume": "100",
            "issn": "",
            "pages": "7289--94",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Synthesis and antiviral activity of 1,2,4-triazole-3-thiocarboxamide and 1,2,4-triazole-3-carboxamidine ribonucleosides",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "T"
                    ],
                    "last": "Witkowski",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "K"
                    ],
                    "last": "Robins",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "P"
                    ],
                    "last": "Khare",
                    "suffix": ""
                }
            ],
            "year": 1973,
            "venue": "Journal of Medicinal Chemistry",
            "volume": "16",
            "issn": "",
            "pages": "935--942",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Viramidine (Ribapharm)",
            "authors": [
                {
                    "first": "D",
                    "middle": [],
                    "last": "Barnard",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "Current Opinion in Investigational Drugs",
            "volume": "3",
            "issn": "",
            "pages": "1585--1594",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Activation and deactivation of a broad-spectrum antiviral drug by a single enzyme: adenosine deaminase catalyzes two consecutive deamination reactions",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "Z"
                    ],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Walker",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "Y"
                    ],
                    "last": "Lau",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Antimicrobial Agents and Chemotherapy",
            "volume": "47",
            "issn": "",
            "pages": "426--457",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Viramidine, a livertargeting ribavirin prodrug, shows better liver-targeting properties and safety profile than ribavirin in animals. Antiviral Chemistry and Chemotherapy",
            "authors": [
                {
                    "first": "C.-C",
                    "middle": [],
                    "last": "Lin",
                    "suffix": ""
                },
                {
                    "first": "L.-T",
                    "middle": [],
                    "last": "Yeh",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Vitarella",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Human adenosine deaminase. Distribution and properties",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "B"
                    ],
                    "last": "Van Der Weyden",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "N"
                    ],
                    "last": "Kelley",
                    "suffix": ""
                }
            ],
            "year": 1976,
            "venue": "Journal of Biological Chemistry",
            "volume": "251",
            "issn": "",
            "pages": "5448--56",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Conversion of 2,6-diamino-9-(2-hydroxyethoxymethyl)purine to acyclovir as catalyzed by adenosine deaminase",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Spector",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "E"
                    ],
                    "last": "Jones",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "M"
                    ],
                    "last": "Beacham",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Iii",
                    "suffix": ""
                }
            ],
            "year": 1983,
            "venue": "Biochemical Pharmacology",
            "volume": "32",
            "issn": "",
            "pages": "2505--2514",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Lipophilic, acid-stable, adenosine deaminase-activated anti-HIV prodrugs for central nervous system delivery. 3. 6-Amino prodrugs of 2′-β-fluoro-2′,3′-dideoxyinosine",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "S"
                    ],
                    "last": "Driscoll",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "A"
                    ],
                    "last": "Siddiqui",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Ford",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Jr",
                    "suffix": ""
                }
            ],
            "year": 1996,
            "venue": "Journal of Medicinal Chemistry",
            "volume": "39",
            "issn": "",
            "pages": "1619--1644",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Mechanism of action of 1-β-D-2,6-diaminopurine dioxolane, a prodrug of the human immunodeficiency virus type 1 inhibitor 1-β-D-dioxolane guanosine",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "A"
                    ],
                    "last": "Furman",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Jeffrey",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "L"
                    ],
                    "last": "Kiefer",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Antimicrobial Agents and Chemotherapy",
            "volume": "45",
            "issn": "",
            "pages": "158--65",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Pharmacokinetic evaluation of (-)-6-aminocarbovir as a prodrug for (-)-carbovir in rats",
            "authors": [],
            "year": null,
            "venue": "Drug Metabolism and Disposition",
            "volume": "20",
            "issn": "",
            "pages": "47--51",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Atomic structure of adenosine deaminase complexed with a transition-state analog: understanding catalysis and immunodeficiency mutations",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "K"
                    ],
                    "last": "Wilson",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "B"
                    ],
                    "last": "Rudolph",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "A"
                    ],
                    "last": "Quiocho",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Science",
            "volume": "252",
            "issn": "",
            "pages": "1278--84",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . *Corresponding author. Tel: +1-714-545-0100, ext. 3024; Fax: +1-714-668-3142; E-mail: jwu@ribapharm.com its positively charged 3-carboxamidine group, viramidine does not transport into RBCs efficiently.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Ribavirin was conceived from the two natural ribonucleosides, showdomycin and pyrazomycin, both of which show significant broad-spectrum antiviral activity. Ribavirin is capable of adopting multiple conformations by rotating the C3-C6 bond to mimic both adenosine and guanine ribonucleosides.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Whole body autoradiography of rats after treatment with [ 14 C]ribavirin and [ 14 C]viramidine. In the experiments, male rats received an oral dose (30 mg/kg) of [ 14 C]ribavirin and [ 14 C]viramidine and were killed at 2 h.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "ADA-catalysed deamination and activation of several nucleoside prodrugs. (a) ADA catalyses two consecutive deamination reactions and converts viramidine into ribavirin and ribavirin into an inactive metabolite, ICN3297. (b)",
            "latex": null,
            "type": "figure"
        }
    },
    "back_matter": []
}