{
    "paper_id": "13a3aa716eb4d50f9f1a2fccf9b81bda7dbbba60",
    "metadata": {
        "title": "TELEUROLOGY IN THE TIME OF COVID-19 PANDEMIC: HERE TO STAY?",
        "authors": [
            {
                "first": "Luciani",
                "middle": [],
                "last": "Lg",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Santa Chiara Hospital",
                    "location": {
                        "settlement": "Trento",
                        "country": "Italy"
                    }
                },
                "email": ""
            },
            {
                "first": "Mattevi",
                "middle": [
                    "D"
                ],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "T",
                "middle": [],
                "last": "Cai",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Santa Chiara Hospital",
                    "location": {
                        "settlement": "Trento",
                        "country": "Italy"
                    }
                },
                "email": ""
            },
            {
                "first": "Giusti",
                "middle": [
                    "G"
                ],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Malossini",
                "middle": [
                    "G"
                ],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Mattevi",
                "middle": [],
                "last": "Daniele",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Santa Chiara Hospital",
                    "location": {
                        "settlement": "Trento",
                        "country": "Italy"
                    }
                },
                "email": "danielemattevi85@gmail.com"
            }
        ]
    },
    "abstract": [
        {
            "text": "Objectives: To assess the implementation and outcomes of telemedicine in a Department of Urology in Northern Italy during the outbreak of the Covid-19 pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Methods: All the outpatient clinical activities during the 4 weeks following the national lockdown (March 9-April 3, 2020) in the Department of Urology of the Trento Province, Italy, were reviewed and categorized. Expert staff members examined the",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "electronic records, selecting whether the clinic appointments should be canceled or confirmed (via telephone consultation or face-to-face visit). The rate, indication, and modality of visits were investigated.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Results: Overall, 415 of 928 (45%) scheduled patients canceled their clinic appointment themselves or were canceled by staff members without rescheduling. The remaining 523 (55%) cases were screened undergoing telephone consultation in 295 (56%) and faceto-face visit in 228 (44%). The rate of face-to-face visit decreased from 63% to 9% during week 1 and 4, respectively. 74% of face-to-face visits regarded suspected recurrent or new onset malignancy or potentially dangerous clinical conditions (severe urinary symptoms or complicated urinary stones or infection). The median age of patients in the face-to-face and telephone groups was 59 (range 20-69) and 65 years old (range 37-88), respectively.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Conclusions: A pandemic is a dynamic scenario, requiring reorganization and flexibility of the healthcare delivery. 45% visits were canceled without rescheduling. Although a minimum portion of face-to-face visit (<10% one month after the lockdown) was preserved mostly for suspected malignancy or potentially life-threatening conditions, telemedicine proved a pragmatic approach allowing efficient screening of cases and adequate protection for patients and clinicians. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Patients selected for face-to-face visits were asked to answer triage questions regarding exposure history or symptoms related to Covid-19 prior to their access to the hospital. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Face-to-face visit modality"
        },
        {
            "text": "Although no one definitive definition of telemedicine exists, WHO has adopted the following broad description: \"The delivery of health care services, where distance is a critical factor, by all health care professionals using information and communication technologies…\" . [5] A recent survey has shown that most patients are willing to use telemedicine, even though some barriers still exist, mainly the preference for in-person care. [6] However, telemedicine in disasters and public health emergencies can be a pragmatic approach allowing efficient screening of cases and adequate protection for patients and clinicians. [4] Its use has recently been suggested in the field of Urology during the Covid-19 pandemic. The authors emphasize that a targeted virtual approach will prove of greater benefit over cancellation, especially in patients with high-risk urological malignancies. [7] In our experience, it was possible to keep a relatively high level of direct consultationabout 55% of all appointments -via telephone or face-to face visits -considering that many were canceled by patients themselves. A vast majority of face-to-face visits regarded sensitive (suspected recurrent or new onset malignancy, 46%) or potentially dangerous clinical conditions (severe urinary symptoms or complicated urinary stones or infection, 28%).",
            "cite_spans": [
                {
                    "start": 273,
                    "end": 276,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 436,
                    "end": 439,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 624,
                    "end": 627,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 885,
                    "end": 888,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "DISCUSSION"
        },
        {
            "text": "However, the criteria to access a face-to-face visit might not be univocal, due to the increasing spread of pandemic over time, which leads to further restrictions in patient selection. In fact, the rate of face-to-face visit decreased from 63% to 9% during week 1 and 4 after the lockdown, respectively. Also, an intentional selection bias to exclude older patients from access to the hospital was introduced in order to reduce their risk of Covid transmission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DISCUSSION"
        },
        {
            "text": "It might be argued that outpatient access during a pandemic should be further decreased or canceled: this might happen extending the use of technology (smart-phones and webcam-enabled computers) in this setting.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DISCUSSION"
        },
        {
            "text": "It should be taken into account that inaccuracy and loss of relevant clinical information might occur during telephone consultation. To this regard, the availability of electronic health records and expert staff members is crucial in order to provide a safe and effective delivery of healthcare. If it is true that a face-to-face visit is mostly preferable as it provides information directly from the patient themselves, the relatively high percentage (45%) of appointments cancelation without rescheduling supports that at least a part of our routine clinic activity might be replaced by appropriately conducted telemedicine even in nonpandemic times.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DISCUSSION"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "WHO Director-General's opening remarks at the media briefing on",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Members of the Research Urology Network (RUN): Urology practice during COVID-19 pandemic",
            "authors": [
                {
                    "first": "V",
                    "middle": [],
                    "last": "Ficarra",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Novara",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Abrate",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Bartoletti",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Crestani",
                    "suffix": ""
                },
                {
                    "first": "De",
                    "middle": [],
                    "last": "Nunzio",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Giannarini",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Gregori",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Liguori",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Mirone",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Pavan",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Scarpa",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "M"
                    ],
                    "last": "Simonato",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Trombetta",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Tubaro",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Porpiglia",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Minerva Urol Nefrol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.23736/S0393-2249.20.03846-1"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Endourological stone management in the era of Covid-19",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Proietti",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Gaboardi",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Giusti",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur Urol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Virtually Perfect? Telemedicine for Covid-19",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "E"
                    ],
                    "last": "Hollander",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "G"
                    ],
                    "last": "Carr",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N Engl J Med",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Telemedicine: Opportunities and developments in Member States",
            "authors": [],
            "year": 2010,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Telehealth Index: 2019 Consumer Survey. Available at",
            "authors": [
                {
                    "first": "American",
                    "middle": [],
                    "last": "Well",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "COVID-19 Pandemic -Is Virtual Urology Clinic the answer to keeping the cancer pathway moving? BJU Int",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Connor",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Winkler",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Miah",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1111/bju.15061"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "is a novel infection with serious clinical manifestations including death. The Director of the World Health Organization (WHO) officially assessed on March 11, 2020, that it could be characterized as a pandemic and advocated \"a comprehensive strategy to prevent infections, save lives and minimize impact\". [1] The pandemic has led to severe shortages of many essential goods and services, presenting an unprecedented challenge to national health systems and determining a massive reshape of the commitment of hospitals and healthcare workers. As well as any other health service, a department of Urology undergoes a deep reorganization. Recommendations and guidelines for the management of surgical procedures and clinical activities have been recently published by national and international panels. [2,3] The development of telemedicine has been suggested as a pragmatic approach to reducing risk of transmission. [4] Our objective is to assess the implementation and outcomes of telemedicine in a Department of Urology in a regional hospital in Northern Italy during the outbreak of Covid-19 pandemic. METHODS Our Department is the only operative urologic service in the Trento Province, serving an area of approximately 540,000 inhabitants in the North-Eastern alpine area of Italy. All the outpatient clinical activities during the 4 weeks following the national lockdown (March 9-April 3, 2020) were reviewed and categorized. The outcomes investigated included: a) the rate of visits canceled or confirmed, b) the outpatient load compared with that of the same period of 2019 (March 11-April 5, 2019), and c) the clinical indications to the face-to-face visits that were confirmed. Indications All scheduled clinic appointments were extensively screened. Andrology & infertility checks were directly canceled by secretaries. Patients with nonurgent conditions, i.e. follow-up oncologic cases, benign conditions (e.g. moderate lower urinary tract symptoms -LUTS -& prostate enlargement), nonseptic urinary tract infections and stones were consulted via telephone. Clinics prioritized suspected recurrent or new onset malignancy, severe LUTS, potentially obstructive/septic urinary stones or urinary tract infections, and immediate postoperative check. Telephone consultation modality The Hospital Information System (HIS) employs a management software including all the relevant data regarding patients and their health status and is available to Specialists and General Practitioners (GPs). Expert staff members of the Department of Urology examined the past and present medical history before calling each Patient by phone. At the end of the consultation, the Urologist released written instructions and prescriptions available online through the HIS to the GP or directly to the Patient and the visit was rescheduled for 4-6 months later.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Patients with positive screening were referred to their GP. In case of negative screening, on the day of visit both Clinicians and Patients were provided with surgical masks and infection-control procedures were used.RESULTSIn the pre-Covid era, approximately 1,000 patients are scheduled each month in our Department (250 per week). Overall, 415 of 928 (45%) patients canceled their clinic appointment themselves, due to the fear of Covid transmission, or were canceled by staff members without rescheduling. The week before the lockdown of the Country, all scheduled patients presented in the office, whereas the rate of cancellation was stable during the study period, accounting for 90 of 250 (36%) and 101 of 250 (40%) during week 1 and 4 after the lockdown, respectively.The remaining 523 (55%) of 928 cases were extensively screened by expert staff members of the Department through electronic records and followed two alternative pathways: telephone consultation in 295 (56%) or face-to-face visit in 228 (44%). As long as the pandemic was spreading, the rate of face-to-face visit decreased steadilyfrom 159 of 250 (63%) to 23 of 250 (9%) during week 1 and 4, respectively. Face-toface visits in week 1 after the lockdown were excluded from analysis, due to substantially unvaried organization of the Department. 69 face-to-face visits in weeks 2-4 after the lockdown were confirmed and included: a) suspected recurrence during oncologic follow-up in 24 cases (35%) b) suspected new onset malignancy with planned biopsy/cystoscopy in 8 (11%) c) severe LUTS & urinary retention in cases in 7 (10%) d) potentially obstructive/septic urinary stones in 6 (9%) e) immediate postoperative check/medication in 4 (6%) f) febrile urinary tract infections in 2 cases (3%) Additionally, complicated catether or suprapubic tube replacement was performed in 18 cases (26%). The median age of patients in the face-to-face and telephone groups were 59 (range 20-69) and 65 years old (range 37-88), respectively.",
            "latex": null,
            "type": "figure"
        }
    },
    "back_matter": []
}